;=======================================================
;===================== GTS UNLOCKS =====================
;=======================================================

[HuntersInstinctUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Ranger: Hunter's Instinct"
Summary="Shots and melee attacks against flanked enemies deal +2 damage."

[HitWhereItHurtsUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Sharpshooter: Deadshot"
Summary="Sniper rifle attacks against unflankable enemies deal +3 damage. Pistol attacks against unflankable enemies deal +1 damage."

[CoolUnderPressureUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Specialist: Cool Under Pressure"
Summary="Gain +10 Aim, +1 Damage, and the ability to critically hit when taking overwatch and reaction shots."

[BiggestBoomsUnlock X2SoldierAbilityUnlockTemplate]
DisplayName="Grenadier: Biggest Booms"
Summary="Explosives gain 20% crit chance and 2 crit damage."

[StayWithMeUnlock X2SoldierUnlockTemplate]
DisplayName="Stay With Me"
Summary="Soldiers are three times more likely to bleed out than die outright."

;=======================================================
;================ BASIC ABILITIES ======================
;=======================================================

[GrimyFlush X2AbilityTemplate]
LocFriendlyName="Flush"
LocHelpText="Fire a shot that forces the target to reposition."
LocLongDescription="<Bullet/>Fire a shot that causes enemies to run out of cover. The shot is easy to hit with, but does reduced damage. Costs 2 ammo."

[GrimyGunSmack X2AbilityTemplate]
LocFriendlyName="Gun Smack"
LocHelpText="Hit an enemy with the butt of your gun. Deals 1 melee damage and has a 50% chance to stun organic enemies."
LocLongDescription="<Bullet/>Hit an enemy for 1 damage and a chance to stun."

[GrimyStealth X2AbilityTemplate]
LocFriendlyName="Sneak"
LocHelpText="Gain concealment for half a turn."
LocLongDescription="<Bullet/>Enter concealment for half a turn. Cannot be used if you are overwatched."

;=======================================================
;================= CLASS ABILITIES =====================
;=======================================================

[GrimyWillToFight X2AbilityTemplate]
LocFriendlyName="Force of Will"
LocLongDescription="Increase melee damage by 10% of your soldier's willpower over 60."
LocHelpText="Increase melee damage by 10% of your soldier's willpower over 60."
LocFlyOverText="Will To Fight"
LocPromotionPopupText="<Bullet/>Increase melee damage by 10% of your soldier's willpower over 60.<br/>"

[GrimyCoordinateFire X2AbilityTemplate]
LocFriendlyName="Coordinate Fire"
LocLongDescription="This soldier and allies within 25 tiles receive covering return fire with their primary weapon for a turn."
LocHelpText="This soldier and allies within 25 tiles receive covering return fire with their primary weapon for a turn."
LocPromotionPopupText="<Bullet/> This soldier and allies within 25 tiles return fire with their primary weapon for a turn.<br/><Bullet/>4 turn cooldown.<br/>"

[GrimyFocusFire X2AbilityTemplate]
LocFriendlyName="Focus Fire"
LocLongDescription="This soldier and all allies fire at the target."
LocHelpText="This soldier and all allies fire at the target."
LocPromotionPopupText="<Bullet/>This soldier and all allies fire at the target.<br/><Bullet/>1 use per mission.<br/>"

[GrimyCloseCombat X2AbilityTemplate]
LocFriendlyName="Close Combat Specialist"
LocLongDescription="Free reaction fire shot against all enemies that approach within 4 tiles."
LocHelpText="Free reaction fire shot against all enemies that approach within 4 tiles."
LocPromotionPopupText="<Bullet/>Free reaction fire shot against all enemies that approach within 4 tiles.<br/>"

[GrimyMayhem X2AbilityTemplate]
LocFriendlyName="Mayhem"
LocLongDescription="Suppression deals 2 damage."
LocHelpText="Suppression deals 2 damage."
LocPromotionPopupText="<Bullet/> Suppression deals 2 damage.<br/>"

[GrimySituationalAwareness X2AbilityTemplate]
LocFriendlyName="Situational Awareness"
LocLongDescription="Increase turn time by 15 seconds."
LocHelpText="Increase turn time by 15 seconds."
LocPromotionPopupText="<Bullet/> Increase turn time by 15 seconds.<br/>"

[GrimySupplyProtocol X2AbilityTemplate]
LocFriendlyName="Supply Protocol"
LocLongDescription="You can now use your gremlins to grab loot. First use of aid protocol now restores 4 reserve ammo."
LocHelpText="You can now use your gremlins to grab loot. First use of aid protocol now restores 4 reserve ammo.."
LocPromotionPopupText="<Bullet/>You can now use your gremlins to grab loot.<br/><Bullet/>First use of aid protocol now restores 4 reserve ammo.<br/>"

[GrimyTriageProtocol X2AbilityTemplate]
LocFriendlyName="Triage Protocol"
LocLongDescription="Provides medical and revival protocol abilities. Aid protocol provides 3 shields for a turn."
LocHelpText="Provides medical and revival protocol abilities. Aid protocol provides 3 shields for a turn."
LocPromotionPopupText="<Bullet/>Provides medical and revival protocol abilities.<br/><Bullet/>Aid protocol provides 3 shields for 2 turns.<br/>"

[GrimyLootProtocol X2AbilityTemplate]
LocFriendlyName="Loot Protocol"
LocLongDescription="Send out your gremlin to pick up loot."
LocHelpText="Send out your gremlin to pick up loot."
LocPromotionPopupText="<Bullet/>Send out your gremlin to pick up loot.<br/>"

[EverVigilant X2AbilityTemplate]
LocFriendlyName="Ever Vigilant"
LocLongDescription="You are granted an automatic overwatch shot at the end of the turn."
LocHelpText="Automatically activate Overwatch at the end of each turn."
LocFlyOverText="Overwatch: Ever Vigilant"
LocPromotionPopupText="<Bullet/> Ever Vigilant enables an extremely mobile style of play for the Specialist.<br/>"

[RestorativeMist X2AbilityTemplate]
LocFriendlyName="Restoration"
LocLongDescription="The GREMLIN flies to each squad member, healing or reviving them as needed. Units healed will have any injury timers from the current missions cleared."
LocHelpText="The GREMLIN flies to each squad member, healing or reviving them as needed. Units healed will have any injury timers from the current missions cleared."
LocFlyOverText="Restoration"
LocPromotionPopupText="<Bullet/> Restoration has one charge per mission.<br/><Bullet/> Restoration will heal more HP as you upgrade your GREMLIN.<br/>"